20220621/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
	</Catalog>
</MetaDataObject>

20220621/InformationRegisters/тм_НастройкиКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>тм_НастройкиКонтрагентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачисляемыйПроцентБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БонусныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.тм_БонусныйСчет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

20220621/Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГосударственныйОрган</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

20220621/Catalogs/Контрагенты/Ext/ObjectModule.bsl
&После("ПриЗаписи")
Процедура тм_ПриЗаписи(Отказ)
	
	ЗаписатьНастройкиКонтрагента();
	
КонецПроцедуры

Процедура ЗаписатьНастройкиКонтрагента()

	Если Не ЭтотОбъект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо Тогда
		Возврат;
	КонецЕсли; 
	
	МЗ = РегистрыСведений.тм_НастройкиКонтрагентов.СоздатьМенеджерЗаписи();
	МЗ.Контрагент = ЭтотОбъект.Ссылка;
	МЗ.Прочитать();
	
	Если ЗначениеЗаполнено(МЗ.БонусныйСчет) Тогда
		Возврат;
	КонецЕсли; 
	
	Отказ = Ложь;
	
	МЗ.Контрагент = ЭтотОбъект.Ссылка;
	МЗ.БонусныйСчет = тм_ОбщегоНазначенияВызовСервера.СоздатьБонусныйСчет(
					  	ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(ЭтотОбъект.Код, Истина, Истина),
						ЭтотОбъект.Ссылка,
						Отказ);
						
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	МЗ.НачисляемыйПроцентБонусов = 3;
	МЗ.Записать();
	
КонецПроцедуры // ЗаписатьНастройкиКонтрагента()
